Revit 2027 API
ModelPath.CloudPath Property
 Whether this path represents a path on an Autodesk server such as BIM360.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CloudPath { get; }
Public ReadOnly Property CloudPath As Boolean
	Get
public:
property bool CloudPath {
	bool get ();
}
member CloudPath : bool with get
Property Value
Boolean
See Also
Reference
ModelPath Class
Autodesk.Revit.DB Namespace